Repository: sunfounder/robot-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api_modules.po
Languages: de, ja

source: module ``modules``
de: Modul ``modules``
ja: モジュール ``modules``

source: class ``Ultrasonic``
de: Klasse ``Ultrasonic``
ja: クラス ``Ultrasonic``

source: **Example**
de: **Beispiel**
ja: **例**

source: class ``ADXL345``
de: Klasse ``ADXL345``
ja: クラス ``ADXL345``

source: Bases: :py:class:`~robot_hat.i2c.I2C`
de: Basisklasse: :py:class:`~robot_hat.i2c.I2C`
ja: 基底: :py:class:`~robot_hat.i2c.I2C`

source: ADXL345 modules
de: ADXL345-Module
ja: ADXL345モジュール

source: Initialize ADXL345
de: ADXL345 initialisieren
ja: ADXL345を初期化する

source: Parameters
de: Parameter
ja: パラメータ

source: address of the ADXL345
de: Adresse des ADXL345
ja: ADXL345のアドレス

source: Read an axis from ADXL345
de: Eine Achse des ADXL345 lesen
ja: ADXL345から軸を読み取る

source: read value(g) of an axis, ADXL345.X, ADXL345.Y or ADXL345.Z, None for all axis
de: Wert (g) einer Achse lesen, ADXL345.X, ADXL345.Y oder ADXL345.Z, None für alle Achsen
ja: 軸の値(g)を読み取る、ADXL345.X、ADXL345.YまたはADXL345.Z、すべての軸の場合はNone

source: Returns
de: Rückgabe
ja: 戻り値

source: value of the axis, or list of all axis
de: Wert der Achse oder Liste aller Achsen
ja: 軸の値、またはすべての軸のリスト

source: Return type
de: Rückgabetyp
ja: 戻り値の型

source: class ``RGB_LED``
de: Klasse ``RGB_LED``
ja: クラス ``RGB_LED``

source: Simple 3 pin RGB LED
de: Einfache 3-Pin-RGB-LED
ja: シンプルな3ピンRGB LED

source: Common anode
de: Gemeinsame Anode
ja: 共通アノード

source: Common cathode
de: Gemeinsame Kathode
ja: 共通カソード

source: Initialize RGB LED
de: RGB-LED initialisieren
ja: RGB LEDを初期化する

source: PWM object for red
de: PWM-Objekt für Rot
ja: 赤用のPWMオブジェクト

source: PWM object for green
de: PWM-Objekt für Grün
ja: 緑用のPWMオブジェクト

source: PWM object for blue
de: PWM-Objekt für Blau
ja: 青用のPWMオブジェクト

source: RGB_LED.ANODE or RGB_LED.CATHODE, default is ANODE
de: RGB_LED.ANODE oder RGB_LED.CATHODE, Standard ist ANODE
ja: RGB_LED.ANODEまたはRGB_LED.CATHODE、デフォルトはANODE

source: Raises
de: Wirft
ja: 例外

source: if common is not ANODE or CATHODE
de: wenn gemeinsam weder ANODE noch CATHODE ist
ja: 共通がANODEまたはCATHODEでない場合

source: if r_pin, g_pin or b_pin is not PWM object
de: wenn r_pin, g_pin oder b_pin kein PWM-Objekt ist
ja: r_pin、g_pin、またはb_pinがPWMオブジェクトでない場合

source: Write color to RGB LED
de: Farbe an RGB-LED schreiben
ja: RGB LEDに色を書き込む

source: color to write, hex string starts with "#", 24-bit int or tuple of (red, green, blue)
de: Zu schreibende Farbe, Hex-String beginnend mit "#", 24-Bit-Integer oder Tupel aus (Rot, Grün, Blau)
ja: 書き込む色、"#"で始まる16進数文字列、24ビット整数、または(red, green, blue)のタプル

source: class ``Buzzer``
de: Klasse ``Buzzer``
ja: クラス ``Buzzer``

source: Imports and initialize
de: Importieren und Initialisieren
ja: インポートと初期化

source: Active buzzer beeping
de: Aktives Summer-Signal
ja: アクティブブザーのビープ音

source: Passive buzzer Simple usage
de: Passiver Summer Einfache Nutzung
ja: パッシブブザーの簡単な使用方法

source: Passive buzzer Manual control
de: Passiver Summer Manuelle Steuerung
ja: パッシブブザーの手動制御

source: Play a song! Baby shark!
de: Ein Lied spielen! Babyhai!
ja: 曲を演奏する！ベイビーシャーク！

source: Initialize buzzer
de: Summer initialisieren
ja: ブザーを初期化する

source: PWM object for passive buzzer or Pin object for active buzzer
de: PWM-Objekt für passiven Summer oder Pin-Objekt für aktiven Summer
ja: パッシブブザー用のPWMオブジェクトまたはアクティブブザー用のピンオブジェクト

source: Turn on buzzer
de: Summer einschalten
ja: ブザーをオンにする

source: Turn off buzzer
de: Summer ausschalten
ja: ブザーをオフにする

source: Set frequency of passive buzzer
de: Frequenz des passiven Summers einstellen
ja: パッシブブザーの周波数を設定する

source: frequency of buzzer, use Music.NOTES to get frequency of note
de: Frequenz des Summers, verwenden Sie Music.NOTES, um die Frequenz der Note zu erhalten
ja: ブザーの周波数、Music.NOTESを使用して音符の周波数を取得する

source: if set to active buzzer
de: wenn auf aktiven Summer eingestellt
ja: アクティブブザーに設定した場合

source: Play freq
de: Frequenz abspielen
ja: 周波数を演奏する

source: freq to play, you can use Music.note() to get frequency of note
de: abzuspielende Frequenz, Sie können Music.note() verwenden, um die Frequenz der Note zu erhalten
ja: 演奏する周波数、Music.note()を使用して音符の周波数を取得できる

source: duration of each note, in seconds, None means play continuously
de: Dauer jeder Note in Sekunden, None bedeutet kontinuierliches Abspielen
ja: 各音符の持続時間（秒）、Noneは連続して演奏することを意味する

source: class ``Grayscale_Module``
de: Klasse ``Grayscale_Module``
ja: クラス ``Grayscale_Module``

source: 3 channel Grayscale Module
de: 3-Kanal-Graustufen-Modul
ja: 3チャンネルグレースケールモジュール

source: Left Channel
de: Linker Kanal
ja: 左チャンネル

source: Middle Channel
de: Mittlerer Kanal
ja: 中央チャンネル

source: Right Channel
de: Rechter Kanal
ja: 右チャンネル

source: Initialize Grayscale Module
de: Graustufen-Modul initialisieren
ja: グレースケールモジュールを初期化する

source: ADC object or int for channel 0
de: ADC-Objekt oder Integer für Kanal 0
ja: チャンネル0用のADCオブジェクトまたは整数

source: ADC object or int for channel 1
de: ADC-Objekt oder Integer für Kanal 1
ja: チャンネル1用のADCオブジェクトまたは整数

source: ADC object or int for channel 2
de: ADC-Objekt oder Integer für Kanal 2
ja: チャンネル2用のADCオブジェクトまたは整数

source: reference voltage
de: Referenzspannung
ja: 基準電圧

source: Get Set reference value
de: Referenzwert abrufen oder einstellen
ja: 基準値の取得と設定

source: reference value, None to get reference value
de: Referenzwert, None um den Referenzwert abzurufen
ja: 基準値、基準値を取得する場合はNone

source: reference value
de: Referenzwert
ja: 基準値

source: Read line status
de: Zeilenstatus lesen
ja: ライン状態の読み取り

source: list of grayscale datas, if None, read from sensor
de: Liste der Graustufendaten, falls None, vom Sensor lesen
ja: グレースケールデータのリスト、Noneの場合はセンサーから読み取り

source: list of line status, 0 for white, 1 for black
de: Liste des Zeilenstatus, 0 für Weiß, 1 für Schwarz
ja: ライン状態のリスト、0は白、1は黒

source: read a channel or all datas
de: einen Kanal oder alle Daten lesen
ja: チャンネルまたはすべてのデータを読み取る

source: channel to read, leave empty to read all. 0, 1, 2 or Grayscale_Module.LEFT, Grayscale_Module.CENTER, Grayscale_Module.RIGHT
de: zu lesender Kanal, leer lassen, um alle zu lesen. 0, 1, 2 oder Grayscale_Module.LEFT, Grayscale_Module.MIDDLE, Grayscale_Module.RIGHT
ja: 読み取るチャンネル、すべてを読み取るには空のままにする。0、1、2またはGrayscale_Module.LEFT、Grayscale_Module.CENTER、Grayscale_Module.RIGHT

source: list of grayscale data
de: Liste der Graustufendaten
ja: グレースケールデータのリスト
