Repository: sunfounder/robot-hat
Catalog: docs/source/locale/*/LC_MESSAGES/project_photoresistor.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo und willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasten-Gemeinschaft auf Facebook! Tauchen Sie tiefer ein in die Welt von Raspberry Pi, Arduino und ESP32 mit anderen Enthusiasten.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Expertenunterstützung**: Lösen Sie Nachverkaufsprobleme und technische Herausforderungen mit Hilfe unserer Gemeinschaft und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tauschen Sie Tipps und Anleitungen aus, um Ihre Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalten Sie frühzeitigen Zugang zu neuen Produktankündigungen und exklusiven Einblicken.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezialrabatte**: Genießen Sie exklusive Rabatte auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nehmen Sie an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Sind Sie bereit, mit uns zu erkunden und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie heute bei!

source: Read from Photoresistor Module
de: Lesen vom Fotowiderstandsmodul

source: In this project, we detect the light intensity and display on the I2C LCD1602.
de: In diesem Projekt erfassen wir die Lichtintensität und zeigen sie auf dem I2C LCD1602 an.

source: **Steps**
de: **Schritte**

source: In this project, an I2C LCD1602 is used, so it's necessary to download the relevant libraries to make it work.
de: In diesem Projekt wird ein I2C LCD1602 verwendet, daher ist es notwendig, die relevanten Bibliotheken herunterzuladen, damit es funktioniert.

source: Install ``smbus2`` for I2C.
de: Installieren Sie ``smbus2`` für I2C.

source: Save the following code to your Raspberry Pi and give it a name, for example, ``photoresistor.ty``.
de: Speichern Sie den folgenden Code auf Ihrem Raspberry Pi und geben Sie ihm einen Namen, zum Beispiel ``photoresistor.ty``.

source: Use the command ``sudo python3 photoresistor.ty`` to run this code.
de: Verwenden Sie den Befehl ``sudo python3 photoresistor.ty``, um diesen Code auszuführen.
